19820960710/TrackingCar-Vision/mspm0/firmware/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000



/* Defines for stepMotor1 */
#define stepMotor1_INST                                                    UART2
#define stepMotor1_INST_FREQUENCY                                        4000000
#define stepMotor1_INST_IRQHandler                              UART2_IRQHandler
#define stepMotor1_INST_INT_IRQN                                  UART2_INT_IRQn
#define GPIO_stepMotor1_RX_PORT                                            GPIOA
#define GPIO_stepMotor1_TX_PORT                                            GPIOA
#define GPIO_stepMotor1_RX_PIN                                    DL_GPIO_PIN_24
#define GPIO_stepMotor1_TX_PIN                                    DL_GPIO_PIN_23
#define GPIO_stepMotor1_IOMUX_RX                                 (IOMUX_PINCM54)
#define GPIO_stepMotor1_IOMUX_TX                                 (IOMUX_PINCM53)
#define GPIO_stepMotor1_IOMUX_RX_FUNC                  IOMUX_PINCM54_PF_UART2_RX
#define GPIO_stepMotor1_IOMUX_TX_FUNC                  IOMUX_PINCM53_PF_UART2_TX
#define stepMotor1_BAUD_RATE                                            (115200)
#define stepMotor1_IBRD_4_MHZ_115200_BAUD                                    (2)
#define stepMotor1_FBRD_4_MHZ_115200_BAUD                                   (11)
/* Defines for stepMotor2 */
#define stepMotor2_INST                                                    UART1
#define stepMotor2_INST_FREQUENCY                                        4000000
#define stepMotor2_INST_IRQHandler                              UART1_IRQHandler
#define stepMotor2_INST_INT_IRQN                                  UART1_INT_IRQn
#define GPIO_stepMotor2_RX_PORT                                            GPIOB
#define GPIO_stepMotor2_TX_PORT                                            GPIOB
#define GPIO_stepMotor2_RX_PIN                                     DL_GPIO_PIN_7
#define GPIO_stepMotor2_TX_PIN                                     DL_GPIO_PIN_6
#define GPIO_stepMotor2_IOMUX_RX                                 (IOMUX_PINCM24)
#define GPIO_stepMotor2_IOMUX_TX                                 (IOMUX_PINCM23)
#define GPIO_stepMotor2_IOMUX_RX_FUNC                  IOMUX_PINCM24_PF_UART1_RX
#define GPIO_stepMotor2_IOMUX_TX_FUNC                  IOMUX_PINCM23_PF_UART1_TX
#define stepMotor2_BAUD_RATE                                            (115200)
#define stepMotor2_IBRD_4_MHZ_115200_BAUD                                    (2)
#define stepMotor2_FBRD_4_MHZ_115200_BAUD                                   (11)
/* Defines for maxicam */
#define maxicam_INST                                                       UART3
#define maxicam_INST_FREQUENCY                                          80000000
#define maxicam_INST_IRQHandler                                 UART3_IRQHandler
#define maxicam_INST_INT_IRQN                                     UART3_INT_IRQn
#define GPIO_maxicam_RX_PORT                                               GPIOB
#define GPIO_maxicam_TX_PORT                                               GPIOB
#define GPIO_maxicam_RX_PIN                                        DL_GPIO_PIN_3
#define GPIO_maxicam_TX_PIN                                        DL_GPIO_PIN_2
#define GPIO_maxicam_IOMUX_RX                                    (IOMUX_PINCM16)
#define GPIO_maxicam_IOMUX_TX                                    (IOMUX_PINCM15)
#define GPIO_maxicam_IOMUX_RX_FUNC                     IOMUX_PINCM16_PF_UART3_RX
#define GPIO_maxicam_IOMUX_TX_FUNC                     IOMUX_PINCM15_PF_UART3_TX
#define maxicam_BAUD_RATE                                               (115200)
#define maxicam_IBRD_80_MHZ_115200_BAUD                                     (43)
#define maxicam_FBRD_80_MHZ_115200_BAUD                                     (26)





/* Port definition for Pin Group GPIO_GRP_0 */
#define GPIO_GRP_0_PORT                                                  (GPIOB)

/* Defines for LED_1: GPIOB.22 with pinCMx 50 on package pin 21 */
#define GPIO_GRP_0_LED_1_PIN                                    (DL_GPIO_PIN_22)
#define GPIO_GRP_0_LED_1_IOMUX                                   (IOMUX_PINCM50)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_stepMotor1_init(void);
void SYSCFG_DL_stepMotor2_init(void);
void SYSCFG_DL_maxicam_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
